// function add(a,b) {
//     return a+b;
// }
// console.log(add(1,2));

// the best syntax incase of having multiple arguments
function sum(...args) {
  // const args = Array.from(arguments);
  // console.log(args); old syntax
  // console.log(arguments); no one uses it as it hasnt got array methods
  // console.log(args);
  let sum = 0;
  for (let i = 0; i < args.length; i++) {
    // console.log(args[i]);

    sum += args[i];
  }
  return sum;
}
// console.log(sum(1,2,3));
// console.log(sum(4,5));
// console.log(sum(123,456,789,101112,131415));

// 4. Напиши функцію myAverageScore , яка у якості аргументу отримує масив з оцінками, і виводить користувачу його середній результат у наступному форматі:
// Myaveragescore: A (якщо середня оцінка від 91 до 100)
// My average score: B (якщо середня оцінка від 81 до 90)
// My average score: C (якщо середня оцінка від 71 до 80)
// My average score: D (якщо середня оцінка від 70 і менше)
// Для перевірки:

function myAverageScore(array) {
  // console.log(array);
  let sum = 0;
  let grade = "";
  for (let i = 0; i < array.length; i++) {
    sum += array[i];
  }
  const averageMark = sum / array.length;
  if (averageMark >= 91 && averageMark <= 100) {
    grade = "Grade A";
  } else if (averageMark >= 81 && averageMark <= 90) {
    grade = "Grade B";
  } else if (averageMark >= 71 && averageMark <= 80) {
    grade = "Grade C";
  } else {
    grade = "Grade D";
  }
  return grade;
}

console.log(myAverageScore([100, 75, 81, 96]));
console.log(myAverageScore([45, 63, 85, 70]));
console.log(myAverageScore([77, 82, 60, 58]));
console.log(myAverageScore([93, 99, 93, 96]));

// Напиши скрипт з наступним функціоналом:



// При завантаженні сторінки користувачеві пропонується в prompt ввести число. Введення зберігається в змінну input і додається в масив чисел numbers.
// Операція введення числа користувачем і збереження в масив триває до тих пор, пір, поки користувач не натисне Cancel в prompt.
// Після того як користувач припинив введення натиснувши Cancel, якщо масив не порожній, необхідно порахувати суму всіх елементів масиву і записати її в змінну total. Використовуй цикл for або for...of. Після чого в консоль виведи рядок 'Загальна сума чисел дорівнює [сума]'.


// 🔔 Робити перевірку того, що користувач ввів саме число, а не довільний набір символів, не обов'язково. Якщо хочеш, в разі некоректного введення, показуй alert з текстом 'Було введено не число, попробуйте ще раз', при цьому результат promptзаписувати в масив чисел не потрібно, після чого знову користувачеві пропонується ввести число в prompt.

let input;
const numbers = [];
let total = 0;

do {
    input = prompt("Введіть число");
    if (input === null) {
        break;
    }
    if (isNaN(input)) {
        alert("Було введено не число, попробуйте ще раз")
        continue;
    }
    const number = Number(input);
    numbers.push(number);

} while (true);

if (numbers.length > 0) {
    for (let i = 0; i < numbers.length; i++) {
        total += numbers[i];
        
    }
    console.log(`Загальна сума чисел дорівнює ${total}`);
    
}
